espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG23/Include/efm32pg23_gpio.h
/* Bit fields for GPIO_KEYSCAN ROWSENSE5ROUTE */
#define _GPIO_KEYSCAN_ROWSENSE5ROUTE_RESETVALUE          0x00000000UL                                     /**< Default value for GPIO_KEYSCAN_ROWSENSE5ROUTE*/
#define _GPIO_KEYSCAN_ROWSENSE5ROUTE_MASK                0x000F0003UL                                     /**< Mask for GPIO_KEYSCAN_ROWSENSE5ROUTE        */
#define _GPIO_KEYSCAN_ROWSENSE5ROUTE_PORT_SHIFT          0                                                /**< Shift value for GPIO_PORT                   */
#define _GPIO_KEYSCAN_ROWSENSE5ROUTE_PORT_MASK           0x3UL                                            /**< Bit mask for GPIO_PORT                      */
#define _GPIO_KEYSCAN_ROWSENSE5ROUTE_PORT_DEFAULT        0x00000000UL                                     /**< Mode DEFAULT for GPIO_KEYSCAN_ROWSENSE5ROUTE*/
#define GPIO_KEYSCAN_ROWSENSE5ROUTE_PORT_DEFAULT         (_GPIO_KEYSCAN_ROWSENSE5ROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_KEYSCAN_ROWSENSE5ROUTE*/
#define _GPIO_KEYSCAN_ROWSENSE5ROUTE_PIN_SHIFT           16                                               /**< Shift value for GPIO_PIN                    */
#define _GPIO_KEYSCAN_ROWSENSE5ROUTE_PIN_MASK            0xF0000UL                                        /**< Bit mask for GPIO_PIN                       */
#define _GPIO_KEYSCAN_ROWSENSE5ROUTE_PIN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_KEYSCAN_ROWSENSE5ROUTE*/
#define GPIO_KEYSCAN_ROWSENSE5ROUTE_PIN_DEFAULT          (_GPIO_KEYSCAN_ROWSENSE5ROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_KEYSCAN_ROWSENSE5ROUTE*/

/* Bit fields for GPIO_LESENSE ROUTEEN */
#define _GPIO_LESENSE_ROUTEEN_RESETVALUE                 0x00000000UL                                     /**< Default value for GPIO_LESENSE_ROUTEEN      */
#define _GPIO_LESENSE_ROUTEEN_MASK                       0x0000FFFFUL                                     /**< Mask for GPIO_LESENSE_ROUTEEN               */
#define GPIO_LESENSE_ROUTEEN_CH0OUTPEN                   (0x1UL << 0)                                     /**< CH0OUT pin enable control bit               */
#define _GPIO_LESENSE_ROUTEEN_CH0OUTPEN_SHIFT            0                                                /**< Shift value for GPIO_CH0OUTPEN              */
#define _GPIO_LESENSE_ROUTEEN_CH0OUTPEN_MASK             0x1UL                                            /**< Bit mask for GPIO_CH0OUTPEN                 */
#define _GPIO_LESENSE_ROUTEEN_CH0OUTPEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH0OUTPEN_DEFAULT           (_GPIO_LESENSE_ROUTEEN_CH0OUTPEN_DEFAULT << 0)   /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH1OUTPEN                   (0x1UL << 1)                                     /**< CH1OUT pin enable control bit               */
#define _GPIO_LESENSE_ROUTEEN_CH1OUTPEN_SHIFT            1                                                /**< Shift value for GPIO_CH1OUTPEN              */
#define _GPIO_LESENSE_ROUTEEN_CH1OUTPEN_MASK             0x2UL                                            /**< Bit mask for GPIO_CH1OUTPEN                 */
#define _GPIO_LESENSE_ROUTEEN_CH1OUTPEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH1OUTPEN_DEFAULT           (_GPIO_LESENSE_ROUTEEN_CH1OUTPEN_DEFAULT << 1)   /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH2OUTPEN                   (0x1UL << 2)                                     /**< CH2OUT pin enable control bit               */
#define _GPIO_LESENSE_ROUTEEN_CH2OUTPEN_SHIFT            2                                                /**< Shift value for GPIO_CH2OUTPEN              */
#define _GPIO_LESENSE_ROUTEEN_CH2OUTPEN_MASK             0x4UL                                            /**< Bit mask for GPIO_CH2OUTPEN                 */
#define _GPIO_LESENSE_ROUTEEN_CH2OUTPEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH2OUTPEN_DEFAULT           (_GPIO_LESENSE_ROUTEEN_CH2OUTPEN_DEFAULT << 2)   /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH3OUTPEN                   (0x1UL << 3)                                     /**< CH3OUT pin enable control bit               */
#define _GPIO_LESENSE_ROUTEEN_CH3OUTPEN_SHIFT            3                                                /**< Shift value for GPIO_CH3OUTPEN              */
#define _GPIO_LESENSE_ROUTEEN_CH3OUTPEN_MASK             0x8UL                                            /**< Bit mask for GPIO_CH3OUTPEN                 */
#define _GPIO_LESENSE_ROUTEEN_CH3OUTPEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH3OUTPEN_DEFAULT           (_GPIO_LESENSE_ROUTEEN_CH3OUTPEN_DEFAULT << 3)   /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH4OUTPEN                   (0x1UL << 4)                                     /**< CH4OUT pin enable control bit               */
#define _GPIO_LESENSE_ROUTEEN_CH4OUTPEN_SHIFT            4                                                /**< Shift value for GPIO_CH4OUTPEN              */
#define _GPIO_LESENSE_ROUTEEN_CH4OUTPEN_MASK             0x10UL                                           /**< Bit mask for GPIO_CH4OUTPEN                 */
#define _GPIO_LESENSE_ROUTEEN_CH4OUTPEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH4OUTPEN_DEFAULT           (_GPIO_LESENSE_ROUTEEN_CH4OUTPEN_DEFAULT << 4)   /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH5OUTPEN                   (0x1UL << 5)                                     /**< CH5OUT pin enable control bit               */
#define _GPIO_LESENSE_ROUTEEN_CH5OUTPEN_SHIFT            5                                                /**< Shift value for GPIO_CH5OUTPEN              */
#define _GPIO_LESENSE_ROUTEEN_CH5OUTPEN_MASK             0x20UL                                           /**< Bit mask for GPIO_CH5OUTPEN                 */
#define _GPIO_LESENSE_ROUTEEN_CH5OUTPEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH5OUTPEN_DEFAULT           (_GPIO_LESENSE_ROUTEEN_CH5OUTPEN_DEFAULT << 5)   /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH6OUTPEN                   (0x1UL << 6)                                     /**< CH6OUT pin enable control bit               */
#define _GPIO_LESENSE_ROUTEEN_CH6OUTPEN_SHIFT            6                                                /**< Shift value for GPIO_CH6OUTPEN              */
#define _GPIO_LESENSE_ROUTEEN_CH6OUTPEN_MASK             0x40UL                                           /**< Bit mask for GPIO_CH6OUTPEN                 */
#define _GPIO_LESENSE_ROUTEEN_CH6OUTPEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH6OUTPEN_DEFAULT           (_GPIO_LESENSE_ROUTEEN_CH6OUTPEN_DEFAULT << 6)   /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH7OUTPEN                   (0x1UL << 7)                                     /**< CH7OUT pin enable control bit               */
#define _GPIO_LESENSE_ROUTEEN_CH7OUTPEN_SHIFT            7                                                /**< Shift value for GPIO_CH7OUTPEN              */
#define _GPIO_LESENSE_ROUTEEN_CH7OUTPEN_MASK             0x80UL                                           /**< Bit mask for GPIO_CH7OUTPEN                 */
#define _GPIO_LESENSE_ROUTEEN_CH7OUTPEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH7OUTPEN_DEFAULT           (_GPIO_LESENSE_ROUTEEN_CH7OUTPEN_DEFAULT << 7)   /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH8OUTPEN                   (0x1UL << 8)                                     /**< CH8OUT pin enable control bit               */
#define _GPIO_LESENSE_ROUTEEN_CH8OUTPEN_SHIFT            8                                                /**< Shift value for GPIO_CH8OUTPEN              */
#define _GPIO_LESENSE_ROUTEEN_CH8OUTPEN_MASK             0x100UL                                          /**< Bit mask for GPIO_CH8OUTPEN                 */
#define _GPIO_LESENSE_ROUTEEN_CH8OUTPEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH8OUTPEN_DEFAULT           (_GPIO_LESENSE_ROUTEEN_CH8OUTPEN_DEFAULT << 8)   /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH9OUTPEN                   (0x1UL << 9)                                     /**< CH9OUT pin enable control bit               */
#define _GPIO_LESENSE_ROUTEEN_CH9OUTPEN_SHIFT            9                                                /**< Shift value for GPIO_CH9OUTPEN              */
#define _GPIO_LESENSE_ROUTEEN_CH9OUTPEN_MASK             0x200UL                                          /**< Bit mask for GPIO_CH9OUTPEN                 */
#define _GPIO_LESENSE_ROUTEEN_CH9OUTPEN_DEFAULT          0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH9OUTPEN_DEFAULT           (_GPIO_LESENSE_ROUTEEN_CH9OUTPEN_DEFAULT << 9)   /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH10OUTPEN                  (0x1UL << 10)                                    /**< CH10OUT pin enable control bit              */
#define _GPIO_LESENSE_ROUTEEN_CH10OUTPEN_SHIFT           10                                               /**< Shift value for GPIO_CH10OUTPEN             */
#define _GPIO_LESENSE_ROUTEEN_CH10OUTPEN_MASK            0x400UL                                          /**< Bit mask for GPIO_CH10OUTPEN                */
#define _GPIO_LESENSE_ROUTEEN_CH10OUTPEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH10OUTPEN_DEFAULT          (_GPIO_LESENSE_ROUTEEN_CH10OUTPEN_DEFAULT << 10) /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH11OUTPEN                  (0x1UL << 11)                                    /**< CH11OUT pin enable control bit              */
#define _GPIO_LESENSE_ROUTEEN_CH11OUTPEN_SHIFT           11                                               /**< Shift value for GPIO_CH11OUTPEN             */
#define _GPIO_LESENSE_ROUTEEN_CH11OUTPEN_MASK            0x800UL                                          /**< Bit mask for GPIO_CH11OUTPEN                */
#define _GPIO_LESENSE_ROUTEEN_CH11OUTPEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH11OUTPEN_DEFAULT          (_GPIO_LESENSE_ROUTEEN_CH11OUTPEN_DEFAULT << 11) /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH12OUTPEN                  (0x1UL << 12)                                    /**< CH12OUT pin enable control bit              */
#define _GPIO_LESENSE_ROUTEEN_CH12OUTPEN_SHIFT           12                                               /**< Shift value for GPIO_CH12OUTPEN             */
#define _GPIO_LESENSE_ROUTEEN_CH12OUTPEN_MASK            0x1000UL                                         /**< Bit mask for GPIO_CH12OUTPEN                */
#define _GPIO_LESENSE_ROUTEEN_CH12OUTPEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH12OUTPEN_DEFAULT          (_GPIO_LESENSE_ROUTEEN_CH12OUTPEN_DEFAULT << 12) /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH13OUTPEN                  (0x1UL << 13)                                    /**< CH13OUT pin enable control bit              */
#define _GPIO_LESENSE_ROUTEEN_CH13OUTPEN_SHIFT           13                                               /**< Shift value for GPIO_CH13OUTPEN             */
#define _GPIO_LESENSE_ROUTEEN_CH13OUTPEN_MASK            0x2000UL                                         /**< Bit mask for GPIO_CH13OUTPEN                */
#define _GPIO_LESENSE_ROUTEEN_CH13OUTPEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH13OUTPEN_DEFAULT          (_GPIO_LESENSE_ROUTEEN_CH13OUTPEN_DEFAULT << 13) /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH14OUTPEN                  (0x1UL << 14)                                    /**< CH14OUT pin enable control bit              */
#define _GPIO_LESENSE_ROUTEEN_CH14OUTPEN_SHIFT           14                                               /**< Shift value for GPIO_CH14OUTPEN             */
#define _GPIO_LESENSE_ROUTEEN_CH14OUTPEN_MASK            0x4000UL                                         /**< Bit mask for GPIO_CH14OUTPEN                */
#define _GPIO_LESENSE_ROUTEEN_CH14OUTPEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH14OUTPEN_DEFAULT          (_GPIO_LESENSE_ROUTEEN_CH14OUTPEN_DEFAULT << 14) /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/
#define GPIO_LESENSE_ROUTEEN_CH15OUTPEN                  (0x1UL << 15)                                    /**< CH15OUT pin enable control bit              */
#define _GPIO_LESENSE_ROUTEEN_CH15OUTPEN_SHIFT           15                                               /**< Shift value for GPIO_CH15OUTPEN             */
#define _GPIO_LESENSE_ROUTEEN_CH15OUTPEN_MASK            0x8000UL                                         /**< Bit mask for GPIO_CH15OUTPEN                */
#define _GPIO_LESENSE_ROUTEEN_CH15OUTPEN_DEFAULT         0x00000000UL                                     /**< Mode DEFAULT for GPIO_LESENSE_ROUTEEN       */
#define GPIO_LESENSE_ROUTEEN_CH15OUTPEN_DEFAULT          (_GPIO_LESENSE_ROUTEEN_CH15OUTPEN_DEFAULT << 15) /**< Shifted mode DEFAULT for GPIO_LESENSE_ROUTEEN*/

/* Bit fields for GPIO_LESENSE CH0OUTROUTE */
#define _GPIO_LESENSE_CH0OUTROUTE_RESETVALUE             0x00000000UL                                  /**< Default value for GPIO_LESENSE_CH0OUTROUTE  */
#define _GPIO_LESENSE_CH0OUTROUTE_MASK                   0x000F0003UL                                  /**< Mask for GPIO_LESENSE_CH0OUTROUTE           */
#define _GPIO_LESENSE_CH0OUTROUTE_PORT_SHIFT             0                                             /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH0OUTROUTE_PORT_MASK              0x3UL                                         /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH0OUTROUTE_PORT_DEFAULT           0x00000000UL                                  /**< Mode DEFAULT for GPIO_LESENSE_CH0OUTROUTE   */
#define GPIO_LESENSE_CH0OUTROUTE_PORT_DEFAULT            (_GPIO_LESENSE_CH0OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH0OUTROUTE*/
#define _GPIO_LESENSE_CH0OUTROUTE_PIN_SHIFT              16                                            /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH0OUTROUTE_PIN_MASK               0xF0000UL                                     /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH0OUTROUTE_PIN_DEFAULT            0x00000000UL                                  /**< Mode DEFAULT for GPIO_LESENSE_CH0OUTROUTE   */
#define GPIO_LESENSE_CH0OUTROUTE_PIN_DEFAULT             (_GPIO_LESENSE_CH0OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH0OUTROUTE*/

